% Task 2: Relational Data

% four.pl
group(102,['Петров','Ивановский','Биткоинов','Шарпин','Эксель','Текстописов','Криптовалютников','Азурин','Круглотличников']).
group(101,['Петровский','Сидоров','Мышин','Безумников','Густобуквенникова']).
group(104,['Иванов','Запорожцев','Джаво','Фулл','Круглосчиталкин','Блокчейнис']).
group(103,['Сидоркин','Эфиркина','Сиплюсплюсов','Программиро','Клавиатурникова','Решетников','Текстописова','Вебсервисов']).

subject('Логическое программирование',[grade('Петров',4),grade('Петровский',2),grade('Иванов',5),grade('Ивановский',5),grade('Запорожцев',5),grade('Сидоров',2),grade('Сидоркин',4),grade('Биткоинов',4),grade('Эфиркина',3),grade('Сиплюсплюсов',4),grade('Программиро',4),grade('Джаво',2),grade('Клавиатурникова',5),grade('Мышин',3),grade('Фулл',5),grade('Безумников',5),grade('Шарпин',5),grade('Круглосчиталкин',4),grade('Решетников',5),grade('Эксель',4),grade('Текстописов',4),grade('Текстописова',5),grade('Густобуквенникова',5),grade('Криптовалютников',5),grade('Блокчейнис',3),grade('Азурин',5),grade('Вебсервисов',5),grade('Круглотличников',3)]).
subject('Математический анализ',[grade('Петров',2),grade('Петровский',4),grade('Иванов',4),grade('Ивановский',4),grade('Запорожцев',4),grade('Сидоров',5),grade('Сидоркин',4),grade('Биткоинов',5),grade('Эфиркина',4),grade('Сиплюсплюсов',5),grade('Программиро',3),grade('Джаво',4),grade('Клавиатурникова',3),grade('Мышин',5),grade('Фулл',4),grade('Безумников',3),grade('Шарпин',4),grade('Круглосчиталкин',4),grade('Решетников',5),grade('Эксель',3),grade('Текстописов',4),grade('Текстописова',4),grade('Густобуквенникова',5),grade('Криптовалютников',4),grade('Блокчейнис',3),grade('Азурин',5),grade('Вебсервисов',4),grade('Круглотличников',5)]).
subject('Функциональное программирование',[grade('Петров',3),grade('Петровский',5),grade('Иванов',4),grade('Ивановский',3),grade('Запорожцев',3),grade('Сидоров',3),grade('Сидоркин',4),grade('Биткоинов',5),grade('Эфиркина',5),grade('Сиплюсплюсов',5),grade('Программиро',4),grade('Джаво',5),grade('Клавиатурникова',5),grade('Мышин',5),grade('Фулл',4),grade('Безумников',5),grade('Шарпин',3),grade('Круглосчиталкин',3),grade('Решетников',4),grade('Эксель',4),grade('Текстописов',3),grade('Текстописова',4),grade('Густобуквенникова',4),grade('Криптовалютников',5),grade('Блокчейнис',5),grade('Азурин',4),grade('Вебсервисов',4),grade('Круглотличников',4)]).
subject('Информатика',[grade('Петров',4),grade('Петровский',3),grade('Иванов',3),grade('Ивановский',4),grade('Запорожцев',3),grade('Сидоров',4),grade('Сидоркин',4),grade('Биткоинов',4),grade('Эфиркина',3),grade('Сиплюсплюсов',2),grade('Программиро',4),grade('Джаво',5),grade('Клавиатурникова',4),grade('Мышин',5),grade('Фулл',3),grade('Безумников',4),grade('Шарпин',5),grade('Круглосчиталкин',5),grade('Решетников',4),grade('Эксель',4),grade('Текстописов',3),grade('Текстописова',5),grade('Густобуквенникова',3),grade('Криптовалютников',2),grade('Блокчейнис',4),grade('Азурин',5),grade('Вебсервисов',4),grade('Круглотличников',4)]).
subject('Английский язык',[grade('Петров',4),grade('Петровский',5),grade('Иванов',3),grade('Ивановский',4),grade('Запорожцев',4),grade('Сидоров',5),grade('Сидоркин',3),grade('Биткоинов',5),grade('Эфиркина',5),grade('Сиплюсплюсов',5),grade('Программиро',4),grade('Джаво',4),grade('Клавиатурникова',3),grade('Мышин',5),grade('Фулл',4),grade('Безумников',3),grade('Шарпин',4),grade('Круглосчиталкин',4),grade('Решетников',2),grade('Эксель',4),grade('Текстописов',4),grade('Текстописова',5),grade('Густобуквенникова',5),grade('Криптовалютников',5),grade('Блокчейнис',3),grade('Азурин',2),grade('Вебсервисов',4),grade('Круглотличников',4)]).
subject('Психология',[grade('Петров',5),grade('Петровский',3),grade('Иванов',3),grade('Ивановский',3),grade('Запорожцев',5),grade('Сидоров',3),grade('Сидоркин',5),grade('Биткоинов',4),grade('Эфиркина',5),grade('Сиплюсплюсов',5),grade('Программиро',3),grade('Джаво',4),grade('Клавиатурникова',4),grade('Мышин',4),grade('Фулл',4),grade('Безумников',2),grade('Шарпин',3),grade('Круглосчиталкин',2),grade('Решетников',4),grade('Эксель',3),grade('Текстописов',3),grade('Текстописова',5),grade('Густобуквенникова',4),grade('Криптовалютников',5),grade('Блокчейнис',5),grade('Азурин',3),grade('Вебсервисов',5),grade('Круглотличников',4)]).

% Вариант 2

% 1)Напечатать средний балл для каждого предмета

%сумма оценок всех учеников по предмету
marks_sum([],0).
marks_sum([grade(X,Y)|T],N):- marks_sum(T,M), N is Y + M.

% cредний балл по предмету
average_mark(Sub,Mark):-subject(Sub,Y), marks_sum(Y, Sum),
    length(Y, Quantity),
    Mark is Sum / Quantity.
%Тесты
%average_mark('Психология', X).
%average_mark('Логическое программирование', X).

% 2)Для каждой группы, найти количество не сдавших студентов

% Список всех оценок по всем предметам
all_marks([],L).
all_marks([H|T], List_pass):-
    subject(H,X), 
    all_marks(T, Cur_list), 
    append(X, Cur_list, List_pass).

% Так как один студент может не сдать сразу несколько предметов,
% существует эта функция, чтобы он посчитался за несдавшего только один раз
smart_del(_,[],[]).
smart_del(X,[X|L],L1):-smart_del(X,L,L1).
smart_del(X,[Y|L],[Y|L1]):- X \= Y, smart_del(X,L,L1).

del_same([],[]).
del_same([H|T],[H|T1]):-smart_del(H,T,T2), del_same(T2,T1).

mymember(H, [H|_]).
mymember(H, [_|T]) :- mymember(H, T).

% Считаем несдавших из конкретной группы
count([],L,0).
count([grade(X,Y)|T],L,N):- Y < 3, mymember(X, L), !, count(T,L,N1), N is N1 + 1.
count([_|T],L,N):-count(T,L,N).

do_not_pass_group(Gr,Count):-
    group(Gr, Lgroup),
    findall(Sub, subject(Sub,_), Subs),
    all_marks(Subs, List_pass),
    del_same(List_pass, Cur),
    count(Cur, Lgroup, Count).
%Тесты
%do_not_pass_group(103,X).
%do_not_pass_group(101,X).


% 3)Найти количество несдавших студентов для каждого из предметов

%количество учеников, не сдавших предмет
do_not_pass_quantity([],0).
do_not_pass_quantity([grade(X,Y)|T],N):- Y < 3, !, do_not_pass_quantity(T,N1), N is N1 + 1.
do_not_pass_quantity([_|T],N):-do_not_pass_quantity(T,N).

%функция, вычисляющая величину do_not_pass_quantity непосредственно для указанного предмета
do_not_pass_sub(Sub,Count):-
    subject(Sub,Y),
    do_not_pass_quantity(Y,Count).
%Тесты
%do_not_pass_sub('Психология', X).
%do_not_pass_sub('Логическое программирование', X).
